app/views/packages/show.html.erb

SELECT "journeys".* FROM "journeys" WHERE "journeys"."package_id" = $1  [["package_id", 601]]
SELECT COUNT(*) FROM "journeys" WHERE "journeys"."package_id" = $1  [["package_id", 668]]
---
Shipment Agent: <%= @package.user.company %><br>
Total Journeys: <%= @package.journeys.count%><br>

SELECT "journeys".* FROM "journeys" WHERE "journeys"."package_id" = $1  [["package_id", 668]]
---
<h5><u>Journeys</u></h5>
<% @package.journeys.each do |journey| %>