app/controllers/packages_controller.rb

SELECT "packages".* FROM "packages"
---
  def index
      @packages = Package.all

SELECT "packages".* FROM "packages" WHERE "packages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
      @package = Package.find(params[:id])